app/Models/Classroom_model.php

SELECT *
FROM `student`
---
    function getStudentInfo() {
        $builder = $this->db->table('student');
        $res = $builder->get()->getResult();

SELECT *
FROM `teacher`
---
    function getTeacherInfo()
    {
        $builder = $this->db->table('teacher');
        $res = $builder->get()->getResult();

SELECT *
FROM `course`
---
    function getCourseInfo()
    {
        $builder = $this->db->table('course');
        $res = $builder->get()->getResult();